{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/hpchome/econ/tmr17/rcr_example/rcr_example.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}26 Aug 2017, 23:58:16
{txt}
{com}. /*******************************************************************
> * RCR_EXAMPLE.DO
> *
> * This is a do-file designed to provide a demonstration of the RCR
> * program and its main features.
> *
> *
> ********************************************************************/
. clear
{txt}
{com}. set mem 10m
{txt}{bf:set memory} ignored.
{p 4 4 2}
Memory no longer
needs to be set in modern Statas;
memory adjustments are performed on the fly
automatically.
{p_end}

{com}. set more off
{txt}
{com}. 
. /* This example uses the kindergarten group from the Project STAR data set used in the paper. */
. /* The data set has already been subject to the fixed-effects transformation */
. use "rcr_example", clear
{txt}(Project STAR data, kindergarten)

{com}. 
. /* This is just an ordinary regression, similar to that in Table 2 of the paper. */
. reg SAT Small_Class White_Asian Girl Free_Lunch White_Teacher Teacher_Experience Masters_Degree

      {txt}Source {c |}       SS       df       MS              Number of obs ={res}    5839
{txt}{hline 13}{char +}{hline 30}           F(  7,  5831) ={res}   85.12
    {txt}   Model {char |} {res} 293684.193     7  41954.8847           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 2874197.02  5831  492.916655           {txt}R-squared     = {res} 0.0927
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0916
    {txt}   Total {char |} {res} 3167881.21  5838  542.631245           {txt}Root MSE      = {res} 22.202

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}               SAT{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      t{col 52}   P>|t|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}Small_Class {c |}{col 20}{res}{space 2} 5.201503{col 32}{space 2} .6425121{col 43}{space 1}    8.10{col 52}{space 3}0.000{col 60}{space 4} 3.941941{col 73}{space 3} 6.461065
{txt}{space 7}White_Asian {c |}{col 20}{res}{space 2} 8.388708{col 32}{space 2} 1.235376{col 43}{space 1}    6.79{col 52}{space 3}0.000{col 60}{space 4} 5.966912{col 73}{space 3}  10.8105
{txt}{space 14}Girl {c |}{col 20}{res}{space 2} 4.382026{col 32}{space 2}  .585478{col 43}{space 1}    7.48{col 52}{space 3}0.000{col 60}{space 4} 3.234272{col 73}{space 3}  5.52978
{txt}{space 8}Free_Lunch {c |}{col 20}{res}{space 2}-13.07747{col 32}{space 2} .7105379{col 43}{space 1}  -18.41{col 52}{space 3}0.000{col 60}{space 4}-14.47039{col 73}{space 3}-11.68455
{txt}{space 5}White_Teacher {c |}{col 20}{res}{space 2} -1.08975{col 32}{space 2} 1.172666{col 43}{space 1}   -0.93{col 52}{space 3}0.353{col 60}{space 4} -3.38861{col 73}{space 3}  1.20911
{txt}Teacher_Experience {c |}{col 20}{res}{space 2} .2650213{col 32}{space 2}  .058137{col 43}{space 1}    4.56{col 52}{space 3}0.000{col 60}{space 4} .1510512{col 73}{space 3} .3789915
{txt}{space 4}Masters_Degree {c |}{col 20}{res}{space 2}-.5996356{col 32}{space 2} .7732745{col 43}{space 1}   -0.78{col 52}{space 3}0.438{col 60}{space 4}-2.115541{col 73}{space 3} .9162693
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 47.09615{col 32}{space 2}  1.52709{col 43}{space 1}   30.84{col 52}{space 3}0.000{col 60}{space 4} 44.10248{col 73}{space 3} 50.08981
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. /* This is RCR analysis of the same regression, with default options */
. rcr SAT Small_Class White_Asian Girl Free_Lunch White_Teacher Teacher_Experience Masters_Degree

{res}
{txt}RCR model{col 55}Number of obs ={res}     5839
{txt}{col 46}Lower bound on lambda  ={res}        0
{txt}{col 46}Upper bound on lambda  ={res}        1


{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         SAT{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}lambdaInf {c |}{col 14}{res}{space 2}  12.3106{col 26}{space 2} 2.098269{col 37}{space 1}    5.87{col 46}{space 3}0.000{col 54}{space 4} 8.198068{col 67}{space 3} 16.42313
{txt}{space 4}betaxInf {c |}{col 14}{res}{space 2}  8.16971{col 26}{space 2} 30.60745{col 37}{space 1}    0.27{col 46}{space 3}0.790{col 54}{space 4}-51.81979{col 67}{space 3} 68.15921
{txt}{space 5}lambda0 {c |}{col 14}{res}{space 2} 28.93549{col 26}{space 2} 108.5195{col 37}{space 1}    0.27{col 46}{space 3}0.790{col 54}{space 4}-183.7588{col 67}{space 3} 241.6298
{txt}{space 6}betaxL {c |}{col 14}{res}{space 2} 5.135044{col 26}{space 2} .9569375{col 37}{space 1}    5.37{col 46}{space 3}0.000{col 54}{space 4} 3.259481{col 67}{space 3} 7.010607
{txt}{space 6}betaxH {c |}{col 14}{res}{space 2} 5.201503{col 26}{space 2} .6564318{col 37}{space 1}    7.92{col 46}{space 3}0.000{col 54}{space 4}  3.91492{col 67}{space 3} 6.488085
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
       betax {c |}    (Conservative confidence interval){res}{col 58} 3.259481{col 70} 6.488085
{txt}{hline 13}{c BT}{hline 64}
Treatment Variable:   {res}Small_Class
{txt}Control Variables :{col 22}{res} White_Asian Girl Free_Lunch White_Teacher
{col 22} Teacher_Experience Masters_Degree
{txt}
{com}. /* The results of the RCR command are stored in e() and so can be saved and used in tables */
. estimates store default
{txt}
{com}. estimates table default , stats(betaxCI_L betaxCI_H N)
{res}
{txt}{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:default} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{space 3}lambdaInf {c |}{res} {ralign 10:12.310599}{txt} {space 1}
{res}{txt}{space 4}betaxInf {c |}{res} {ralign 10:8.16971}{txt} {space 1}
{res}{txt}{space 5}lambda0 {c |}{res} {ralign 10:28.935489}{txt} {space 1}
{res}{txt}{space 6}betaxL {c |}{res} {ralign 10:5.1350438}{txt} {space 1}
{res}{txt}{space 6}betaxH {c |}{res} {ralign 10:5.2015026}{txt} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{ralign 12:betaxCI_L} {c |}{res} {ralign 10:3.2594807}{txt} {space 1}
{ralign 12:betaxCI_H} {c |}{res} {ralign 10:6.4880853}{txt} {space 1}
{ralign 12:N} {c |}{res} {ralign 10:5839}{txt} {space 1}
{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}

{com}. 
. /* The LAMBDA option allows for the user to control the range of lambda values */
. rcr SAT Small_Class White_Asian Girl Free_Lunch White_Teacher Teacher_Experience Masters_Degree, lambda(0 2)

{res}
{txt}RCR model{col 55}Number of obs ={res}     5839
{txt}{col 46}Lower bound on lambda  ={res}        0
{txt}{col 46}Upper bound on lambda  ={res}        2


{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         SAT{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}lambdaInf {c |}{col 14}{res}{space 2}  12.3106{col 26}{space 2} 2.098269{col 37}{space 1}    5.87{col 46}{space 3}0.000{col 54}{space 4} 8.198068{col 67}{space 3} 16.42313
{txt}{space 4}betaxInf {c |}{col 14}{res}{space 2}  8.16971{col 26}{space 2} 30.60745{col 37}{space 1}    0.27{col 46}{space 3}0.790{col 54}{space 4}-51.81979{col 67}{space 3} 68.15921
{txt}{space 5}lambda0 {c |}{col 14}{res}{space 2} 28.93549{col 26}{space 2} 108.5195{col 37}{space 1}    0.27{col 46}{space 3}0.790{col 54}{space 4}-183.7588{col 67}{space 3} 241.6298
{txt}{space 6}betaxL {c |}{col 14}{res}{space 2} 5.065541{col 26}{space 2} 1.557969{col 37}{space 1}    3.25{col 46}{space 3}0.001{col 54}{space 4} 2.011978{col 67}{space 3} 8.119104
{txt}{space 6}betaxH {c |}{col 14}{res}{space 2} 5.201503{col 26}{space 2} .6564318{col 37}{space 1}    7.92{col 46}{space 3}0.000{col 54}{space 4}  3.91492{col 67}{space 3} 6.488085
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
       betax {c |}    (Conservative confidence interval){res}{col 58} 2.011978{col 70} 6.488085
{txt}{hline 13}{c BT}{hline 64}
Treatment Variable:   {res}Small_Class
{txt}Control Variables :{col 22}{res} White_Asian Girl Free_Lunch White_Teacher
{col 22} Teacher_Experience Masters_Degree
{txt}
{com}. /* Use missing (.) to denote absence of an upper or lower bound. */
. /* Note that in this particular example, the bounds on betax are (-infinity,infinity).  Since Stata
>  * has no facility for manipulating infinity, infinity is reported as just a very large number. */
. rcr SAT Small_Class White_Asian Girl Free_Lunch White_Teacher Teacher_Experience Masters_Degree, lambda(0 .)

{res}
{txt}RCR model{col 55}Number of obs ={res}     5839
{txt}{col 46}Lower bound on lambda  ={res}        0
{txt}{col 46}Upper bound on lambda  ={res}        .


{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         SAT{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}lambdaInf {c |}{col 14}{res}{space 2}  12.3106{col 26}{space 2} 2.098269{col 37}{space 1}    5.87{col 46}{space 3}0.000{col 54}{space 4} 8.198068{col 67}{space 3} 16.42313
{txt}{space 4}betaxInf {c |}{col 14}{res}{space 2}  8.16971{col 26}{space 2} 30.60745{col 37}{space 1}    0.27{col 46}{space 3}0.790{col 54}{space 4}-51.81979{col 67}{space 3} 68.15921
{txt}{space 5}lambda0 {c |}{col 14}{res}{space 2} 28.93549{col 26}{space 2} 108.5195{col 37}{space 1}    0.27{col 46}{space 3}0.790{col 54}{space 4}-183.7588{col 67}{space 3} 241.6298
{txt}{space 6}betaxL {c |}{col 14}{res}{space 2}-9.0e+306{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}{space 6}betaxH {c |}{col 14}{res}{space 2} 9.0e+306{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
       betax {c |}    (Conservative confidence interval){res}{col 58}-9.0e+306{col 70} 9.0e+306
{txt}{hline 13}{c BT}{hline 64}
Treatment Variable:   {res}Small_Class
{txt}Control Variables :{col 22}{res} White_Asian Girl Free_Lunch White_Teacher
{col 22} Teacher_Experience Masters_Degree
{txt}
{com}. 
. /* By default confidence intervals are estimated conservatively.  The CITYPE option allows the choice of other methods. */
. rcr SAT Small_Class White_Asian Girl Free_Lunch White_Teacher Teacher_Experience Masters_Degree, citype("Imbens-Manski")

{res}
{txt}RCR model{col 55}Number of obs ={res}     5839
{txt}{col 46}Lower bound on lambda  ={res}        0
{txt}{col 46}Upper bound on lambda  ={res}        1


{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         SAT{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}lambdaInf {c |}{col 14}{res}{space 2}  12.3106{col 26}{space 2} 2.098269{col 37}{space 1}    5.87{col 46}{space 3}0.000{col 54}{space 4} 8.198068{col 67}{space 3} 16.42313
{txt}{space 4}betaxInf {c |}{col 14}{res}{space 2}  8.16971{col 26}{space 2} 30.60745{col 37}{space 1}    0.27{col 46}{space 3}0.790{col 54}{space 4}-51.81979{col 67}{space 3} 68.15921
{txt}{space 5}lambda0 {c |}{col 14}{res}{space 2} 28.93549{col 26}{space 2} 108.5195{col 37}{space 1}    0.27{col 46}{space 3}0.790{col 54}{space 4}-183.7588{col 67}{space 3} 241.6298
{txt}{space 6}betaxL {c |}{col 14}{res}{space 2} 5.135044{col 26}{space 2} .9569375{col 37}{space 1}    5.37{col 46}{space 3}0.000{col 54}{space 4} 3.259481{col 67}{space 3} 7.010607
{txt}{space 6}betaxH {c |}{col 14}{res}{space 2} 5.201503{col 26}{space 2} .6564318{col 37}{space 1}    7.92{col 46}{space 3}0.000{col 54}{space 4}  3.91492{col 67}{space 3} 6.488085
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
       betax {c |}    (Imbens-Manski confidence interval){res}{col 58}  3.29158{col 70} 6.466066
{txt}{hline 13}{c BT}{hline 64}
Treatment Variable:   {res}Small_Class
{txt}Control Variables :{col 22}{res} White_Asian Girl Free_Lunch White_Teacher
{col 22} Teacher_Experience Masters_Degree
{txt}
{com}. 
. /* The VCEADJ allows for the user to adjust the covariance matrix estimates by a multiplicative factor.  This can be 
>  * used to implement degrees-of-freedom corrections when the data has been transformed (e.g., normalization or
>  * fixed-effects transformations). */
. quietly duplicates report SCHID
{txt}
{com}. local dofcorrection = r(N)/(r(N)-r(unique_value))
{txt}
{com}. di "There are " r(N) " observations, but the data have received the fixed-effects transformation." _newline /*
> */ "That is, each variable is expressed in terms of its deviation from the school-level average." _newline  /*
> */ "There are " r(unique_value) " schools in the data, so the effective number of observations is " r(N)-r(unique_value) "." _newline /*
> */ "So we should multiply the covariance matrix by " r(N) "/(" r(N) "-" r(unique_value) ") = `dofcorrection'."
{res}There are 5839 observations, but the data have received the fixed-effects transformation.
That is, each variable is expressed in terms of its deviation from the school-level average.
There are 79 schools in the data, so the effective number of observations is 5760.
So we should multiply the covariance matrix by 5839/(5839-79) = 1.013715277777778.
{txt}
{com}. rcr SAT Small_Class White_Asian Girl Free_Lunch White_Teacher Teacher_Experience Masters_Degree, vceadj(`dofcorrection')

{res}
{txt}RCR model{col 55}Number of obs ={res}     5839
{txt}{col 46}Lower bound on lambda  ={res}        0
{txt}{col 46}Upper bound on lambda  ={res}        1


{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         SAT{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}lambdaInf {c |}{col 14}{res}{space 2}  12.3106{col 26}{space 2} 2.112608{col 37}{space 1}    5.83{col 46}{space 3}0.000{col 54}{space 4} 8.169963{col 67}{space 3} 16.45124
{txt}{space 4}betaxInf {c |}{col 14}{res}{space 2}  8.16971{col 26}{space 2} 30.81663{col 37}{space 1}    0.27{col 46}{space 3}0.791{col 54}{space 4}-52.22977{col 67}{space 3} 68.56919
{txt}{space 5}lambda0 {c |}{col 14}{res}{space 2} 28.93549{col 26}{space 2} 109.2611{col 37}{space 1}    0.26{col 46}{space 3}0.791{col 54}{space 4}-185.2124{col 67}{space 3} 243.0833
{txt}{space 6}betaxL {c |}{col 14}{res}{space 2} 5.135044{col 26}{space 2} .9634774{col 37}{space 1}    5.33{col 46}{space 3}0.000{col 54}{space 4} 3.246663{col 67}{space 3} 7.023425
{txt}{space 6}betaxH {c |}{col 14}{res}{space 2} 5.201503{col 26}{space 2}  .660918{col 37}{space 1}    7.87{col 46}{space 3}0.000{col 54}{space 4} 3.906127{col 67}{space 3} 6.496878
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
       betax {c |}    (Conservative confidence interval){res}{col 58} 3.246663{col 70} 6.496878
{txt}{hline 13}{c BT}{hline 64}
Treatment Variable:   {res}Small_Class
{txt}Control Variables :{col 22}{res} White_Asian Girl Free_Lunch White_Teacher
{col 22} Teacher_Experience Masters_Degree
{txt}
{com}. 
. /* The LEVEL and CLUSTER options work the same as they do for most Stata commands (e.g., REG) */
. /* IF, IN, and weights (all 4 types) are supported as well. */
. rcr SAT Small_Class White_Asian Girl Free_Lunch White_Teacher Teacher_Experience Masters_Degree, level(90)

{res}
{txt}RCR model{col 55}Number of obs ={res}     5839
{txt}{col 46}Lower bound on lambda  ={res}        0
{txt}{col 46}Upper bound on lambda  ={res}        1


{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         SAT{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [90% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}lambdaInf {c |}{col 14}{res}{space 2}  12.3106{col 26}{space 2} 2.098269{col 37}{space 1}    5.87{col 46}{space 3}0.000{col 54}{space 4} 8.859254{col 67}{space 3} 15.76194
{txt}{space 4}betaxInf {c |}{col 14}{res}{space 2}  8.16971{col 26}{space 2} 30.60745{col 37}{space 1}    0.27{col 46}{space 3}0.790{col 54}{space 4}-42.17507{col 67}{space 3} 58.51449
{txt}{space 5}lambda0 {c |}{col 14}{res}{space 2} 28.93549{col 26}{space 2} 108.5195{col 37}{space 1}    0.27{col 46}{space 3}0.790{col 54}{space 4}-149.5632{col 67}{space 3} 207.4341
{txt}{space 6}betaxL {c |}{col 14}{res}{space 2} 5.135044{col 26}{space 2} .9569375{col 37}{space 1}    5.37{col 46}{space 3}0.000{col 54}{space 4} 3.561022{col 67}{space 3} 6.709066
{txt}{space 6}betaxH {c |}{col 14}{res}{space 2} 5.201503{col 26}{space 2} .6564318{col 37}{space 1}    7.92{col 46}{space 3}0.000{col 54}{space 4} 4.121768{col 67}{space 3} 6.281237
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
       betax {c |}    (Conservative confidence interval){res}{col 58} 3.561022{col 70} 6.281237
{txt}{hline 13}{c BT}{hline 64}
Treatment Variable:   {res}Small_Class
{txt}Control Variables :{col 22}{res} White_Asian Girl Free_Lunch White_Teacher
{col 22} Teacher_Experience Masters_Degree
{txt}
{com}. rcr SAT Small_Class White_Asian Girl Free_Lunch White_Teacher Teacher_Experience Masters_Degree, cluster(TCHID)

{res}
{txt}RCR model{col 55}Number of obs ={res}     5839
{txt}{col 46}Lower bound on lambda  ={res}        0
{txt}{col 46}Upper bound on lambda  ={res}        1


{txt}{ralign 78:(Std. Err. adjusted for {res:323} clusters in TCHID)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         SAT{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}lambdaInf {c |}{col 14}{res}{space 2}  12.3106{col 26}{space 2} 8.316739{col 37}{space 1}    1.48{col 46}{space 3}0.139{col 54}{space 4} -3.98991{col 67}{space 3} 28.61111
{txt}{space 4}betaxInf {c |}{col 14}{res}{space 2}  8.16971{col 26}{space 2} 43.64582{col 37}{space 1}    0.19{col 46}{space 3}0.852{col 54}{space 4}-77.37452{col 67}{space 3} 93.71394
{txt}{space 5}lambda0 {c |}{col 14}{res}{space 2} 28.93549{col 26}{space 2} 145.1773{col 37}{space 1}    0.20{col 46}{space 3}0.842{col 54}{space 4}-255.6069{col 67}{space 3} 313.4778
{txt}{space 6}betaxL {c |}{col 14}{res}{space 2} 5.135044{col 26}{space 2} 1.358694{col 37}{space 1}    3.78{col 46}{space 3}0.000{col 54}{space 4} 2.472053{col 67}{space 3} 7.798034
{txt}{space 6}betaxH {c |}{col 14}{res}{space 2} 5.201503{col 26}{space 2} 1.030597{col 37}{space 1}    5.05{col 46}{space 3}0.000{col 54}{space 4}  3.18157{col 67}{space 3} 7.221435
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
       betax {c |}    (Conservative confidence interval){res}{col 58} 2.472053{col 70} 7.221435
{txt}{hline 13}{c BT}{hline 64}
Treatment Variable:   {res}Small_Class
{txt}Control Variables :{col 22}{res} White_Asian Girl Free_Lunch White_Teacher
{col 22} Teacher_Experience Masters_Degree
{txt}
{com}. 
. /* The ESTAT postestimation command is supported */
. estat vce
{res}
{txt}Covariance matrix of coefficients of {res:rcr} model
{res}
{txt}{space 0}{space 0}{ralign 12:e(V)}{space 1}{c |}{space 1}{ralign 10:lambdaInf}{space 1}{space 1}{ralign 10:betaxInf}{space 1}{space 1}{ralign 10:lambda0}{space 1}{space 1}{ralign 10:betaxL}{space 1}{space 1}{ralign 10:betaxH}{space 1}
{space 0}{hline 13}{c   +}{hline 12}{hline 12}{hline 12}{hline 12}{hline 12}
{space 0}{space 0}{ralign 12:lambdaInf}{space 1}{c |}{space 1}{ralign 10:{res:{sf: 69.168147}}}{space 1}{space 1}{ralign 10:{res:{sf:{space 10}}}}{space 1}{space 1}{ralign 10:{res:{sf:{space 10}}}}{space 1}{space 1}{ralign 10:{res:{sf:{space 10}}}}{space 1}{space 1}{ralign 10:{res:{sf:{space 10}}}}{space 1}
{space 0}{space 0}{ralign 12:betaxInf}{space 1}{c |}{space 1}{ralign 10:{res:{sf: 126.63081}}}{space 1}{space 1}{ralign 10:{res:{sf: 1904.9575}}}{space 1}{space 1}{ralign 10:{res:{sf:{space 10}}}}{space 1}{space 1}{ralign 10:{res:{sf:{space 10}}}}{space 1}{space 1}{ralign 10:{res:{sf:{space 10}}}}{space 1}
{space 0}{space 0}{ralign 12:lambda0}{space 1}{c |}{space 1}{ralign 10:{res:{sf:-121.54894}}}{space 1}{space 1}{ralign 10:{res:{sf:-6125.9088}}}{space 1}{space 1}{ralign 10:{res:{sf: 21076.458}}}{space 1}{space 1}{ralign 10:{res:{sf:{space 10}}}}{space 1}{space 1}{ralign 10:{res:{sf:{space 10}}}}{space 1}
{space 0}{space 0}{ralign 12:betaxL}{space 1}{c |}{space 1}{ralign 10:{res:{sf:-1.9440658}}}{space 1}{space 1}{ralign 10:{res:{sf:-37.514102}}}{space 1}{space 1}{ralign 10:{res:{sf: 129.09626}}}{space 1}{space 1}{ralign 10:{res:{sf: 1.8460481}}}{space 1}{space 1}{ralign 10:{res:{sf:{space 10}}}}{space 1}
{space 0}{space 0}{ralign 12:betaxH}{space 1}{c |}{space 1}{ralign 10:{res:{sf: .12294018}}}{space 1}{space 1}{ralign 10:{res:{sf: 3.6638149}}}{space 1}{space 1}{ralign 10:{res:{sf:-6.6076979}}}{space 1}{space 1}{ralign 10:{res:{sf: 1.0050687}}}{space 1}{space 1}{ralign 10:{res:{sf: 1.0621295}}}{space 1}

{com}. estat summarize

{txt}  Estimation sample {res}rcr
{col 33}{txt}Number of obs        ={res}     5839

{col 33}{txt}Number of clusters   ={res}      323
{col 33}{txt}Obs per cluster: min ={res}        9
{col 33}{txt}                 avg ={res}     18.1
{col 33}{txt}                 max ={res}       27

{txt}  {hline 13}{c TT}{hline 47}
      Variable {c |}        Mean     Std. Dev.       Min        Max
  {hline 13}{c +}{hline 47}
{space 11}SAT {c |}{res}{col 20} 51.44962{col 33} 23.29445{col 45}-15.7624{col 56} 127.289
{txt}{space 3}Small_Class {c |}{res}{col 20}  .302449{col 33} .4537342{col 45}-.132334{col 56} 1.13789
{txt}{space 3}White_Asian {c |}{res}{col 20} .6723754{col 33} .2394896{col 45}-.317625{col 56}  1.6565
{txt}{space 10}Girl {c |}{res}{col 20} .4874122{col 33} .4965591{col 45}-.186057{col 56} 1.18741
{txt}{space 4}Free_Lunch {c |}{res}{col 20} .4836445{col 33}  .416402{col 45}-.497308{col 56} 1.46849
{txt}{space 2}White_Teac~r {c |}{res}{col 20} .8405549{col 33} .2504451{col 45}-.034445{col 56} 1.66278
{txt}{space 2}Teacher_Ex~e {c |}{res}{col 20} 9.266998{col 33} 5.152943{col 45}-2.39967{col 56} 25.0565
{txt}{space 2}Masters_De~e {c |}{res}{col 20} .3519438{col 33} .3908864{col 45}-.498056{col 56}  1.2427
{txt}  {hline 13}{c BT}{hline 47}
  Std. Dev. not adjusted for clustering
{res}{txt}
{com}. 
. /* For hypothesis testing of point-identified parameters (including betaxH and betaxL), the TESTNL and NLCOM postestimation commands can be used */
. testnl _b[betaxL] = 0

{col 3}{txt}(1){res}{col 8}{bind:_b[betaxL] = 0}

{txt}{ralign 22:chi2({res:1})} =  {res}     14.28
{txt}{ralign 22:Prob > chi2} =  {res}      0.0002{txt}

{com}. nlcom _b[betaxH] - _b[betaxL]

       {txt}_nl_1:  {res}_b[betaxH] - _b[betaxL]

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         SAT{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_nl_1 {c |}{col 14}{res}{space 2} .0664588{col 26}{space 2} .9476498{col 37}{space 1}    0.07{col 46}{space 3}0.944{col 54}{space 4}-1.790901{col 67}{space 3} 1.923818
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. /* There is also a postestimation command test_betax for testing hypotheses about the interval-identified parameter betax */
. /* You can test any point null hypothesis.  This line of code tests H0: betax = 1.25 */
. test_betax = 1.25

{txt} ( 1)     {res}betax = 1.25

{col 10}{txt}P-value = {res}0.0039
{txt}
{com}. /* If you call test_betax without any arguments, the default is to test H0: betax = 0. */
. test_betax

{txt} ( 1)     {res}betax = 0

{col 10}{txt}P-value = {res}0.0001
{txt}
{com}. 
. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/hpchome/econ/tmr17/rcr_example/rcr_example.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}26 Aug 2017, 23:58:17
{txt}{.-}
{smcl}
{txt}{sf}{ul off}